Interesante875/ECE4191-G15/ECE4191/ColorBowlRobot_G15.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "MOTOR_EN_RIGHT_aliases.h"
#include "MOTOR_EN_RIGHT.h"
#include "PWM_RIGHT.h"
#include "MOTOR_RIGHT_PHASE_B_aliases.h"
#include "MOTOR_RIGHT_PHASE_B.h"
#include "MOTOR_RIGHT_PHASE_A_aliases.h"
#include "MOTOR_RIGHT_PHASE_A.h"
#include "QuadDec_RIGHT.h"
#include "QuadDec_RIGHT_PVT.h"
#include "MOTOR_LEFT_PHASE_B_aliases.h"
#include "MOTOR_LEFT_PHASE_B.h"
#include "MOTOR_LEFT_PHASE_A_aliases.h"
#include "MOTOR_LEFT_PHASE_A.h"
#include "QuadDec_LEFT.h"
#include "QuadDec_LEFT_PVT.h"
#include "MOTOR_RIGHT_IN_4_aliases.h"
#include "MOTOR_RIGHT_IN_4.h"
#include "MOTOR_RIGHT_IN_3_aliases.h"
#include "MOTOR_RIGHT_IN_3.h"
#include "MOTOR_EN_LEFT_aliases.h"
#include "MOTOR_EN_LEFT.h"
#include "Clock_1.h"
#include "PWM_LEFT.h"
#include "isr_color_sensor.h"
#include "Clock_2.h"
#include "Counter_Color_Sensor.h"
#include "PWM_Color_Sensor.h"
#include "MOTOR_LEFT_IN_2_aliases.h"
#include "MOTOR_LEFT_IN_2.h"
#include "MOTOR_LEFT_IN_1_aliases.h"
#include "MOTOR_LEFT_IN_1.h"
#include "isr_input.h"
#include "IR_Sensor_LEFT_aliases.h"
#include "IR_Sensor_LEFT.h"
#include "Wheel_Timer.h"
#include "UART_1.h"
#include "Control_Reg_Color_Sensor.h"
#include "S0_aliases.h"
#include "S0.h"
#include "S1_aliases.h"
#include "S1.h"
#include "S2_aliases.h"
#include "S2.h"
#include "S3_aliases.h"
#include "S3.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Count_aliases.h"
#include "Count.h"
#include "Clock_3.h"
#include "Trigger_aliases.h"
#include "Trigger.h"
#include "Echo_LEFT_aliases.h"
#include "Echo_LEFT.h"
#include "isr_ultrasonic.h"
#include "Echo_RIGHT_aliases.h"
#include "Echo_RIGHT.h"
#include "Control_Reg_Ultrasonic.h"
#include "IR_Sensor_RIGHT_aliases.h"
#include "IR_Sensor_RIGHT.h"
#include "Echo_FLEFT_aliases.h"
#include "Echo_FLEFT.h"
#include "Echo_FRIGHT_aliases.h"
#include "Echo_FRIGHT.h"
#include "Timer_Ultrasonic.h"
#include "Clock_4.h"
#include "isr_IR_Sensor_LEFT.h"
#include "isr_IR_Sensor_RIGHT.h"
#include "Echo_BACK_aliases.h"
#include "Echo_BACK.h"
#include "isr_puck.h"
#include "PWM_Servo_Gripper.h"
#include "Clock_5.h"
#include "PWM_Servo_Gripper_Arm.h"
#include "PWM_Servo_Lifter.h"
#include "PWM_Servo_Trunk.h"
#include "MOTOR_GRIPPER_aliases.h"
#include "MOTOR_GRIPPER.h"
#include "MOTOR_GRIPPER_ARM_aliases.h"
#include "MOTOR_GRIPPER_ARM.h"
#include "MOTOR_LIFTER_aliases.h"
#include "MOTOR_LIFTER.h"
#include "MOTOR_TRUNK_aliases.h"
#include "MOTOR_TRUNK.h"
#include "isr_wheel_controller.h"
#include "Indicator_RED_aliases.h"
#include "Indicator_RED.h"
#include "Indicator_GREEN_aliases.h"
#include "Indicator_GREEN.h"
#include "Indicator_BLUE_aliases.h"
#include "Indicator_BLUE.h"
#include "QuadDec_RIGHT_isr.h"
#include "QuadDec_RIGHT_Cnt16.h"
#include "QuadDec_LEFT_isr.h"
#include "QuadDec_LEFT_Cnt16.h"
#include "UART_1_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

